blog/org_roam_workflow.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>having fun with notes</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="../style.css" type="text/css"/> <link rel="icon" href="../img_doc/favicon.png" type="image/x-icon"/>
</head>
<body>
<div id="preamble" class="status">
<nav>
  <a href="../index.html">&lt; Home</a>
</nav>
<div id="updated">Updated: 2023-04-18 Tue 06:21</div>
</div>
<div id="content" class="content">
<header>
<h1 class="title">having fun with notes</h1>
</header><p>
As every man of culture I like to procastinate with optimizing some system of mine instead of actually get work done. As I recently dove into the emacs-org-mode-rabbit-hole I of course stumbled onto org-roam and was immediatly captured. Although I was never a big note-taker I see the potential of having a database of resources and thoughts to fall back onto. I read a lot, watch youtube-videos and listen to podcasts but I can't help but forget most of it. Ralph Waldo Emerson always conforted me with his famous quote, but it still bothers me that I keep forgetting a lot of really useful information, and maybe even worse, I often forget where to refind the information. Org Roam may be an appealing solution, only time will tell. For now I want to share my configuration and workflow using mostly <a href="https://github.com/doomemacs/doomemacs">Doom Emacs</a>  and <a href="https://www.zotero.org/">Zotero</a>.
</p>

<blockquote>
<p>
“I cannot remember the books I've read any more than the meals I have eaten; even so, they have made me.”
</p>

<p>
― Ralph Waldo Emerson
</p>
</blockquote>

<div id="outline-container-orgf36049c" class="outline-2">
<h2 id="orgf36049c">What is it?</h2>
<div class="outline-text-2" id="text-orgf36049c">
<p>
<a href="https://www.orgroam.com/">Org Roam</a> is an open-source (!) note-taking-software for <a href="https://orgmode.org">Emacs Org-Mode</a>. It was created by Jethro Kuan as a light weight package which is able to implement the Zettelkasten-method.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2023-04-16 Sun 00:00</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 28.2 (<a href="https://orgmode.org">Org</a> mode 9.5.5)</p>
</div>
</body>
</html>
